# Задание 4.
# Напишите функцию, которая будет проверять номер сотового телефона на валидность, если он валиден,
# то переводить его в формат:
# +7(xxx)-xxx-xx-xx
#
# Постарайтесь предусмотреть как можно больше адекватных форматов изначального ввода номера. Примеры валидных форматов:
# Примеры валидных форматов:
#
# • +7 955 555-55-55;
# • 9555555555;
# • 8(955)555-55-55;
# • +7 955 555 55 55;
# • 7(955) 555-55-55;
# • +7 955+555+55+55.

import re


def get_phone_number(s):
    match = re.match("^[+]?[78]?[ ]?[-( +]?[0-9]{3}[-) +]?[ ]?[0-9]{3}[- +]?[0-9]{2}[- +]?[0-9]{2}$", s)
    if match is None:
        print('Неверный формат номера')
        return None
    s = re.sub("[-+ ()]", "", s)
    if len(s) == 11:
        s = s[1:]
    return '+7' + re.sub(r'(\d\d\d)(\d\d\d)(\d\d)(\d\d)', r'(\1)-\2-\3-\4', s)


# test
print(get_phone_number('+7 955 555-55-55'))
print(get_phone_number('9555555555'))
print(get_phone_number('8(955)555-55-55'))
print(get_phone_number('+7 955 555 55 55'))
print(get_phone_number('7(955) 555-55-55'))
print(get_phone_number('+7 955+555+55+55'))
print(get_phone_number('+9 955+555+55+55'))  # invalid
